jpc007/stm32n6570-dk-first/FSBL/Core/Src/main.c
/* USER CODE BEGIN Header */
/**
  ******************************************************************************
  * @file           : main.c
  * @brief          : Main program body
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2026 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  */
/* USER CODE END Header */
/* Includes ------------------------------------------------------------------*/
#include "main.h"

/* Private includes ----------------------------------------------------------*/
/* USER CODE BEGIN Includes */
#include "stm32n6xx_hal_ltdc.h"
#include "stm32n6xx_hal_rif.h"
#include <string.h>
/* USER CODE END Includes */

/* Private typedef -----------------------------------------------------------*/
/* USER CODE BEGIN PTD */

/* USER CODE END PTD */

/* Private define ------------------------------------------------------------*/
/* USER CODE BEGIN PD */
#define LCD_WIDTH   800U
#define LCD_HEIGHT  480U
#define LCD_HSYNC   4U
#define LCD_HBP     4U
#define LCD_HFP     4U
#define LCD_VSYNC   4U
#define LCD_VBP     4U
#define LCD_VFP     4U
#define FB_ADDRESS  0x34200000U  /* SRAM3 secure alias */
/* USER CODE END PD */

/* Private macro -------------------------------------------------------------*/
/* USER CODE BEGIN PM */

/* USER CODE END PM */

/* Private variables ---------------------------------------------------------*/
ADC_HandleTypeDef hadc1;

I2C_HandleTypeDef hi2c1;
I2C_HandleTypeDef hi2c2;

MDF_HandleTypeDef MdfHandle0;
MDF_FilterConfigTypeDef MdfFilterConfig0;

SAI_HandleTypeDef hsai_BlockA1;
SAI_HandleTypeDef hsai_BlockB1;

SD_HandleTypeDef hsd2;

UART_HandleTypeDef huart1;

HCD_HandleTypeDef hhcd_USB_OTG_HS2;

XSPI_HandleTypeDef hxspi1;
XSPI_HandleTypeDef hxspi2;

/* USER CODE BEGIN PV */
LTDC_HandleTypeDef hltdc;
static UART_HandleTypeDef huart2;
/* USER CODE END PV */

/* Private function prototypes -----------------------------------------------*/
void SystemClock_Config(void);
void PeriphCommonClock_Config(void);
static void MX_GPIO_Init(void);
static void MX_ADC1_Init(void);
static void MX_I2C1_Init(void);
static void MX_I2C2_Init(void);
static void MX_MDF1_Init(void);
static void MX_SAI1_Init(void);
static void MX_SDMMC2_SD_Init(void);
static void MX_UCPD1_Init(void);
static void MX_USART1_UART_Init(void);
static void MX_USB1_OTG_HS_HCD_Init(void);
static void MX_USB2_OTG_HS_HCD_Init(void);
static void MX_XSPI1_Init(void);
static void MX_XSPI2_Init(void);
/* USER CODE BEGIN PFP */
static void Security_Config(void);
static void SRAM_Enable(void);
static void USART2_Init(void);
static void LTDC_ClockConfig(void);
static void LTDC_Init_Phase1(void);
static void UART_Print(const char *msg);
/* USER CODE END PFP */

/* Private user code ---------------------------------------------------------*/
/* USER CODE BEGIN 0 */

/* ------------------------------------------------------------------ */
/* UART helper                                                        */
/* ------------------------------------------------------------------ */
static void UART_Print(const char *msg)
{
  HAL_UART_Transmit(&huart2, (const uint8_t *)msg,
                    (uint16_t)strlen(msg), 200);
}

/* ------------------------------------------------------------------ */
/* USART2 TX on PD5 (AF7) — debug trace                              */
/* ------------------------------------------------------------------ */
static void USART2_Init(void)
{
  RCC_PeriphCLKInitTypeDef pclk = {0};
  GPIO_InitTypeDef gpio = {0};

  pclk.PeriphClockSelection = RCC_PERIPHCLK_USART2;
  pclk.Usart2ClockSelection = RCC_USART2CLKSOURCE_CLKP;
  HAL_RCCEx_PeriphCLKConfig(&pclk);
  __HAL_RCC_USART2_CLK_ENABLE();
  __HAL_RCC_GPIOD_CLK_ENABLE();

  gpio.Pin       = GPIO_PIN_5;
  gpio.Mode      = GPIO_MODE_AF_PP;
  gpio.Pull      = GPIO_NOPULL;
  gpio.Speed     = GPIO_SPEED_FREQ_LOW;
  gpio.Alternate = GPIO_AF7_USART2;
  HAL_GPIO_Init(GPIOD, &gpio);

  huart2.Instance          = USART2;
  huart2.Init.BaudRate     = 115200;
  huart2.Init.WordLength   = UART_WORDLENGTH_8B;
  huart2.Init.StopBits     = UART_STOPBITS_1;
  huart2.Init.Parity       = UART_PARITY_NONE;
  huart2.Init.Mode         = UART_MODE_TX;
  huart2.Init.HwFlowCtl    = UART_HWCONTROL_NONE;
  huart2.Init.OverSampling = UART_OVERSAMPLING_16;
  HAL_UART_Init(&huart2);
}

/* ------------------------------------------------------------------ */
/* Security : RIMC masters + RISC slaves for LTDC (SEC+PRIV)         */
/* Matches ST official examples exactly                               */
/* ------------------------------------------------------------------ */
static void Security_Config(void)
{
  __HAL_RCC_RIFSC_CLK_ENABLE();

  RIMC_MasterConfig_t rimc = {0};
  rimc.MasterCID = RIF_CID_1;
  rimc.SecPriv   = RIF_ATTRIBUTE_SEC | RIF_ATTRIBUTE_PRIV;

  HAL_RIF_RIMC_ConfigMasterAttributes(RIF_MASTER_INDEX_LTDC1, &rimc);
  HAL_RIF_RIMC_ConfigMasterAttributes(RIF_MASTER_INDEX_LTDC2, &rimc);

  HAL_RIF_RISC_SetSlaveSecureAttributes(RIF_RISC_PERIPH_INDEX_LTDC,   RIF_ATTRIBUTE_SEC | RIF_ATTRIBUTE_PRIV);
  HAL_RIF_RISC_SetSlaveSecureAttributes(RIF_RISC_PERIPH_INDEX_LTDCL1, RIF_ATTRIBUTE_SEC | RIF_ATTRIBUTE_PRIV);
  HAL_RIF_RISC_SetSlaveSecureAttributes(RIF_RISC_PERIPH_INDEX_LTDCL2, RIF_ATTRIBUTE_SEC | RIF_ATTRIBUTE_PRIV);
}

/* ------------------------------------------------------------------ */
/* Enable SRAM3+SRAM4 (AXI SRAMs for framebuffer) via HAL            */
/* ------------------------------------------------------------------ */
static void SRAM_Enable(void)
{
  RAMCFG_HandleTypeDef hramcfg = {0};

  __HAL_RCC_AXISRAM3_MEM_CLK_ENABLE();
  __HAL_RCC_AXISRAM4_MEM_CLK_ENABLE();
  __HAL_RCC_RAMCFG_CLK_ENABLE();

  hramcfg.Instance = RAMCFG_SRAM3_AXI;
  HAL_RAMCFG_EnableAXISRAM(&hramcfg);

  hramcfg.Instance = RAMCFG_SRAM4_AXI;
  HAL_RAMCFG_EnableAXISRAM(&hramcfg);
}

