jpc007/stm32n6570-dk-first/FSBL/Core/Src/main.c
/* ------------------------------------------------------------------ */
/* LTDC pixel clock : IC16 = PLL4 / 2 = 25 MHz                       */
/* PLL4 is configured in SystemClock_Config (600 MHz output)          */
/* ------------------------------------------------------------------ */
static void LTDC_ClockConfig(void)
{
  RCC_PeriphCLKInitTypeDef pclk = {0};
  pclk.PeriphClockSelection = RCC_PERIPHCLK_LTDC;
  pclk.LtdcClockSelection   = RCC_LTDCCLKSOURCE_IC16;
  pclk.ICSelection[RCC_IC16].ClockSelection = RCC_ICCLKSOURCE_PLL4;
  pclk.ICSelection[RCC_IC16].ClockDivider   = 24;  /* 600 / 24 = 25 MHz */
  HAL_RCCEx_PeriphCLKConfig(&pclk);
}

/* ------------------------------------------------------------------ */
/* HAL_LTDC_MspInit callback — GPIO setup for all LCD pins            */
/* Called automatically by HAL_LTDC_Init()                            */
/* Pin mapping from STM32N6570-DK BSP (stm32n6570_discovery_lcd.c)   */
/* ------------------------------------------------------------------ */
void HAL_LTDC_MspInit(LTDC_HandleTypeDef *hltdc_arg)
{
  GPIO_InitTypeDef gpio = {0};

  __HAL_RCC_LTDC_CLK_ENABLE();
  __HAL_RCC_LTDC_FORCE_RESET();
  __HAL_RCC_LTDC_RELEASE_RESET();

  __HAL_RCC_GPIOA_CLK_ENABLE();
  __HAL_RCC_GPIOB_CLK_ENABLE();
  __HAL_RCC_GPIOD_CLK_ENABLE();
  __HAL_RCC_GPIOE_CLK_ENABLE();
  __HAL_RCC_GPIOG_CLK_ENABLE();
  __HAL_RCC_GPIOH_CLK_ENABLE();
  __HAL_RCC_GPIOQ_CLK_ENABLE();

  gpio.Mode      = GPIO_MODE_AF_PP;
  gpio.Pull      = GPIO_NOPULL;
  gpio.Speed     = GPIO_SPEED_FREQ_HIGH;
  gpio.Alternate = GPIO_AF14_LCD;

  /* GPIOA : G3(PA0), G2(PA1), B7(PA2), B1(PA7), B6(PA8), R5(PA15) */
  gpio.Pin = GPIO_PIN_0 | GPIO_PIN_1 | GPIO_PIN_2 | GPIO_PIN_7 | GPIO_PIN_8 | GPIO_PIN_15;
  HAL_GPIO_Init(GPIOA, &gpio);

  /* GPIOB : B2(PB2), R3(PB4), G6(PB11), G5(PB12), CLK(PB13), HSYNC(PB14), G4(PB15) */
  gpio.Pin = GPIO_PIN_2 | GPIO_PIN_4 | GPIO_PIN_11 | GPIO_PIN_12 | GPIO_PIN_13 | GPIO_PIN_14 | GPIO_PIN_15;
  HAL_GPIO_Init(GPIOB, &gpio);

  /* GPIOD : R7(PD8), R1(PD9), R2(PD15) */
  gpio.Pin = GPIO_PIN_8 | GPIO_PIN_9 | GPIO_PIN_15;
  HAL_GPIO_Init(GPIOD, &gpio);

  /* GPIOE : VSYNC(PE11) */
  gpio.Pin = GPIO_PIN_11;
  HAL_GPIO_Init(GPIOE, &gpio);

  /* GPIOG : R0(PG0), G1(PG1), B3(PG6), G7(PG8), R6(PG11), G0(PG12) */
  gpio.Pin = GPIO_PIN_0 | GPIO_PIN_1 | GPIO_PIN_6 | GPIO_PIN_8 | GPIO_PIN_11 | GPIO_PIN_12;
  HAL_GPIO_Init(GPIOG, &gpio);

  /* GPIOH : B4(PH3), R4(PH4), B5(PH6) */
  gpio.Pin = GPIO_PIN_3 | GPIO_PIN_4 | GPIO_PIN_6;
  HAL_GPIO_Init(GPIOH, &gpio);

  /* B0 = PP15 → need GPIOP */
  __HAL_RCC_GPIOP_CLK_ENABLE();
  gpio.Pin = GPIO_PIN_15;
  HAL_GPIO_Init(GPIOP, &gpio);

  /* ---- Control GPIOs (output PP, not AF) ---- */
  gpio.Mode = GPIO_MODE_OUTPUT_PP;
  gpio.Speed = GPIO_SPEED_FREQ_LOW;

  /* NRST (PE1) : reset pulse */
  gpio.Pin = GPIO_PIN_1;
  HAL_GPIO_Init(GPIOE, &gpio);
  HAL_GPIO_WritePin(GPIOE, GPIO_PIN_1, GPIO_PIN_RESET);
  HAL_Delay(10);
  HAL_GPIO_WritePin(GPIOE, GPIO_PIN_1, GPIO_PIN_SET);
  HAL_Delay(10);

  /* LCD_ONOFF (PQ3) */
  gpio.Pin = GPIO_PIN_3;
  HAL_GPIO_Init(GPIOQ, &gpio);
  HAL_GPIO_WritePin(GPIOQ, GPIO_PIN_3, GPIO_PIN_SET);

  /* LCD_DE (PG13) — display enable (held HIGH) */
  gpio.Pin = GPIO_PIN_13;
  HAL_GPIO_Init(GPIOG, &gpio);
  HAL_GPIO_WritePin(GPIOG, GPIO_PIN_13, GPIO_PIN_SET);

  /* LCD_BL_CTRL (PQ6) — backlight 100% */
  gpio.Pin = GPIO_PIN_6;
  HAL_GPIO_Init(GPIOQ, &gpio);
  HAL_GPIO_WritePin(GPIOQ, GPIO_PIN_6, GPIO_PIN_SET);
}

/* ------------------------------------------------------------------ */
/* LTDC init + Layer 0 config + framebuffer fill                      */
/* ------------------------------------------------------------------ */
static void LTDC_Init_Phase1(void)
{
  LTDC_LayerCfgTypeDef layer = {0};

  /* LTDC timing configuration (RK050HR18 800x480 panel) */
  hltdc.Instance = LTDC;
  hltdc.Init.HSPolarity = LTDC_HSPOLARITY_AL;
  hltdc.Init.VSPolarity = LTDC_VSPOLARITY_AL;
  hltdc.Init.DEPolarity = LTDC_DEPOLARITY_AL;
  hltdc.Init.PCPolarity = LTDC_PCPOLARITY_IPC;

  hltdc.Init.HorizontalSync     = LCD_HSYNC - 1U;
  hltdc.Init.AccumulatedHBP     = LCD_HSYNC + LCD_HBP - 1U;
  hltdc.Init.AccumulatedActiveW = LCD_HSYNC + LCD_WIDTH + LCD_HBP - 1U;
  hltdc.Init.TotalWidth         = LCD_HSYNC + LCD_WIDTH + LCD_HBP + LCD_HFP - 1U;
  hltdc.Init.VerticalSync       = LCD_VSYNC - 1U;
  hltdc.Init.AccumulatedVBP     = LCD_VSYNC + LCD_VBP - 1U;
  hltdc.Init.AccumulatedActiveH = LCD_VSYNC + LCD_HEIGHT + LCD_VBP - 1U;
  hltdc.Init.TotalHeigh         = LCD_VSYNC + LCD_HEIGHT + LCD_VBP + LCD_VFP - 1U;

  hltdc.Init.Backcolor.Blue  = 0;
  hltdc.Init.Backcolor.Green = 0;
  hltdc.Init.Backcolor.Red   = 0;

  if (HAL_LTDC_Init(&hltdc) != HAL_OK)
  {
    UART_Print("[LTDC] HAL_LTDC_Init FAILED\r\n");
    return;
  }
  UART_Print("[LTDC] HAL_LTDC_Init OK\r\n");

  /* Layer 0 : full screen RGB565, framebuffer in SRAM3 */
  layer.WindowX0        = 0;
  layer.WindowX1        = LCD_WIDTH;
  layer.WindowY0        = 0;
  layer.WindowY1        = LCD_HEIGHT;
  layer.PixelFormat     = LTDC_PIXEL_FORMAT_RGB565;
  layer.Alpha           = 255;
  layer.Alpha0          = 0;
  layer.BlendingFactor1 = LTDC_BLENDING_FACTOR1_CA;
  layer.BlendingFactor2 = LTDC_BLENDING_FACTOR2_CA;
  layer.FBStartAdress   = FB_ADDRESS;
  layer.ImageWidth      = LCD_WIDTH;
  layer.ImageHeight     = LCD_HEIGHT;
  layer.Backcolor.Blue  = 0;
  layer.Backcolor.Green = 0;
  layer.Backcolor.Red   = 0;

  if (HAL_LTDC_ConfigLayer(&hltdc, &layer, 0) != HAL_OK)
  {
    UART_Print("[LTDC] ConfigLayer FAILED\r\n");
    return;
  }
  UART_Print("[LTDC] Layer 0 configured\r\n");

  /* Fill framebuffer with solid RED (RGB565 = 0xF800) */
  {
    volatile uint16_t *fb = (volatile uint16_t *)FB_ADDRESS;
    for (uint32_t i = 0; i < LCD_WIDTH * LCD_HEIGHT; i++)
    {
      fb[i] = 0xF800U;
    }
  }
  UART_Print("[LTDC] Framebuffer filled RED\r\n");

  __HAL_LTDC_ENABLE(&hltdc);
}

/* USER CODE END 0 */

/**
  * @brief  The application entry point.
  * @retval int
  */
int main(void)
{

  /* USER CODE BEGIN 1 */
  /* ---- DIAGNOSTIC ULTRA-PRECOCE : LED VERTE via CMSIS direct ---- */
  /* Confirme que le FSBL demarre reellement (avant HAL_Init).       */
  RCC->AHB4ENSR = RCC_AHB4ENR_GPIODEN;   /* clock GPIOD ON (SET register) */
  __DSB();
  GPIOD->MODER = (GPIOD->MODER & ~(3UL << (0*2))) | (1UL << (0*2)); /* PD0 output */
  GPIOD->BSRR  = (1UL << 0);             /* PD0 HIGH = LED VERTE            */
  /* La LED restera ON pendant toute la sequence MX_xxx_Init + boot.  */
  /* USER CODE END 1 */

  /* MCU Configuration--------------------------------------------------------*/
  HAL_Init();

